// pages/vip/vip.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    vipinfo: '  松鼠趣邦按照会员积分成长值，划分为“普通”“优秀”、“卓越”、“特级”，每个级别的会员除基础权益相同外，均享有逐级递增的会员权益。',
    vipinfo1: '不同等级会员在后续使用时，将按照会员级别享受不同程度的抵扣优惠：在入驻松鼠趣邦的众多联盟商家中也可以享受对应联盟折扣优惠。',
    vipinfo2: '不止可以享受体系内的积分兑换优惠，会员积分在松鼠趣邦体系内以及外部联盟资源中能够实现权益互通，做到积分通兑。',
    vipinfo3: '生日独家惊喜礼包派送，为您带来最暖心的关怀。',
    vipinfo4: '会员服务优享，折扣、兑换、关怀、服务......小松鼠一路为您提供贴心陪伴。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})